<template>
  <div class="return-product container about-tech">
      <h1>О технологиях</h1>

<p>Молнии YKK YKK - это группа японских компаний. На данный момент она занимает лидирующие позиции в производстве молнии и фурнитуры.
Куртка или брюки могут быть высочайшего качества. Но в них легко разочароваться, если молния будет тугой или сломается. Молнии YKK - лидер на рынке. Своё признание завоевали прочностью, надёжностью, удобством и долговечностью.</p>
<p>
В нашей одежде используется молнии серии VISLON Zipper, они изготавливаются из специального сплава, который легче металла.
</p>
<img src="/img/tec1.png">

<p>Мембранная ткань – это инновационный материал с избирательной проницаемостью. Обладает повышенными защитными свойствами. Используется для производства детской, спортивной одежды, экипировки приверженцев активного зимнего отдыха, представителей экстремальных профессий.
Тело человека в среднем за сутки выделяет более полулитра влаги, которая накапливается на одежде изнутри, если нет выхода наружу. При активных движениях объем выделяющегося пота может достигать полутора литров. Введение мембран в состав защитных тканей позволяет выводить пары воды, не допуская при этом попадание внутрь влаги, ветра, дождя, снега. Мембранный слой в тканяхпропускает маленькие молекулы наружу, не запуская ничего внутрь. Верхняя одежда из мембранной ткани сберегает от дождя, ветра, снега, обеспечивает «дыхание» телу, способствует обеспечению тепловых комфортных ощущений. В наших изделиях используется мембрана с показателями водонепроницаемости в 10000 мм (для обычных условий дождливой погоды).
</p>
<img src="/img/tec2.png">

<p>Светоотражающий элемент Это важный элемент пассивной безопасности пешехода и снижает риск несчастных случаев в тёмное время суток в 6,5 раз. Водители автомобилей в темное время суток обнаруживают пешехода, имеющего светоотражатель, со значительно большего расстояния. При движении с ближним светом фар расстояние обнаружения увеличивается с 25-40 метров до 130-140, а при движении с дальним светом – до 400 метров. Поэтому, наша одежда обязательно снабжена светоотражателями со всех сторон (варежки - не исключение)! Штрипки Штрипки - очень полюбившаяся мамочкам деталь. Они надежно крепятся на пуговичках изделия и не дадут штанине подниматься вверх (что предотвращает попаданию снега под брюки).
</p>
<img src="/img/tec3.png">
<p>В производстве нашей одежды используются высококачественные каучуковые штрипки, которые выдерживают бОльшую разрывную силу. Они будут "переходить по наследству" от одного малыша - к другому, а не порвутся в первый же день эксплуатации.
</p>
<img src="/img/tec4.png">

<p>Во всех моделях брюк есть регулирующиеся лямки. Они легко регулируются по длине, за счёт чего ребёнок может носить брюки по 2-4 года. Но самое важное - лямки не дают брюкам спадать, препятствуя попаданию снега за пояс во время активных игр.
Карабины используются небольшие, максимально лёгкие и тонкие. Но при совокупности этих свойств - очень надёжные!
</p>
<img src="/img/tec5.png">

<p>Все зимние куртки и комбинезоны имеют флисовый подклад.<br>
Важные преимущества флиса:
</p>
<ul>
    <li>Эластичность</li>
    <li>Простой уход: машинная стирка, быстрая сушка</li>
    <li>Простой уход: машинная стирка, быстрая сушка</li>
    <li>Прочный к разрывам, растягиваниям, стиранию</li>
    <li>Легкий и очень теплый</li>
    <li>Держит тепло даже если намокнет</li>
    <li>Гипоаллергенен</li>
</ul>
<p>
Одежда с флисовым подкладом не требует дополнительных поддев в долгие зимние прогулки, что существенно облегчает процесс одевания ребёнка (особенно в детском саду). Флис - источник дополнительного тепла. За счёт своих "дышащих"функций - не даёт ребёнку промокнуть во время активных игр, выводя излишки влаги через мембранную ткань наружу. Все швы нашей одежды проклеены!
</p>
<img src="/img/tec6.png">

<p>Игла швейной машины оставляет в мембране мельчайшие отверстия, через которые может просочиться вода. Чтобы герметизировать их, используется специальная лента, которой проклеивается строчка шва.
</p>
<img src="/img/tec7.png">
  </div>
</template>

<script>
export default {
    name: 'AboutTech',
    metaInfo(){
            return {
                title: "О технологиях"
            }
    },
}
</script>

<style>


</style>