<template>
   <div class="return-product container about-brand">
       <h1>Кто мы?</h1>
<p>
До 2014, в течении 10 лет мы приносили скандинавское тепло в российские семьи, поставляли детскую одежду из Финляндии.
</p>
<p>
Однако, мы начали замечать, что комплектующие и ткани ухудшились по качеству. Европейские производители стали замещать качественную фурнитуру и ткань дешевыми аналогами. Мембранная ткань перестала соответствовать первоначально заявленным характеристикам.
</p>
<p>
Бренды оставались теми же, а качество сильно ухудшалось, что заметили и мы, как заботливые родители.
Поэтому мы создали свой бренд, чтобы создать возможность получать качественную европейскую одежду без посредников.
</p>
<p>
    Мы понимаем, насколько важно, чтобы реальные характеристики соответствовали тому, что написано на этикетке.
От этого напрямую зависит здоровье детей. Если мембрана не дышит и не выводит воду, активный ребенок потеет, вся влага не выводится и остаётся под одеждой, а мокрый ребёнок быстро замерзает и простывает!
</p>
<p>
Более того, ужасно, если с первого дня эксплуатации на одежде рвутся штрипки, расходятся молнии, выходят из строя кнопки.
</p>
<p>
Поэтому, для нашей одежды мы выбрали самую высококачественную фурнитуру и мембрану.
Lappinalle остаётся сухой, дышит, но сохраняет тепло, выводит конденсат и обладает высокими износостойкими характеристиками.
Линейки нашей одежды выпускаются ограниченными сериями. Красочные сочные принты производим эксклюзивно, по 1 км ткани.
Мы разрабатываем коллекции совместно со скандинавскими технологами, поэтому при изготовлении нашей одежды используется та же размерная сетка (одежда большемерит на 6 см).
</p>
<p>
Мы хотим создавать то, что сохранит здоровье и создаст комфорт нашим детям, при этом прослужит долгие годы.
Наша цель в том, чтобы качественные современные технологии были доступными для каждой семьи.
6 лет мы трудились над разработкой и проверкой нашей продукции и в 2020 году она стала доступна для всех заботливых родителей на нашем сайте.
С 2014 года одеждой Lappinalle заинтересовались семьи по всей России. У нас есть модели как для сурового Сибирского климата, так и для более мягкого. Количество утеплителя варьируется от 60 до 300 г.
На сегодняшний день в России у нас 1300000 постоянных покупателей, преданных нашему бренду. Становитесь частью нашего сообщества родителей, которые выбирают лучшее для своих детей.
</p>
   </div>
</template>

<script>
export default {
    name: 'AboutBrand',
    metaInfo(){
            return {
                title: "О бренде"
            }
    },
}
</script>

<style>
</style>
