<template>
    <div class="privacy container">
        <h1>
            Политика конфиденциальности
        </h1>
        <h2>
            Общие положения
        </h2>
        <p>
            Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые LAPPINALLE (далее – Оператор).<br><br>
            Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.<br><br>
            Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайт https://lappinalle.ru/
        </p>
        <h2>
            Основные понятия, используемые в Политике
        </h2>
        <p>
            Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники;<br><br>
            Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);<br><br>
            Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу https://lappinalle.ru/;<br><br>
            Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств;<br><br>
            Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных;<br><br>
            Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;<br><br>
            Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;<br><br>
            Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта https://lappinalle.ru/;<br><br>
            Пользователь – любой посетитель веб-сайта https://lappinalle.ru/;<br><br>
            Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;<br><br>
            Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом;<br><br>
            Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу;<br><br>
            Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или)

            уничтожаются материальные носители персональных данных
        </p>
        <h2>
            Оператор может обрабатывать следующие персональные данные Пользователя
        </h2>
        <p>
            Фамилия, имя, отчество;<br><br>
            Электронный адрес;<br><br>
            Номера телефонов;<br><br>
            Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).<br><br>
            Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.
        </p>
        <h2>
            Цели обработки персональных данных
        </h2>
        <p>
            Цель обработки персональных данных Пользователя — информирование Пользователя посредством отправки электронных писем.<br><br>
            Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты info@lappinalle.ru с пометкой «Отказ от уведомлений о новых продуктах и услугах и специальных предложениях». <br><br>
            Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.
        </p>
        <h2>
            Правовые основания обработки персональных данных
        </h2>
        <p>
            Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте https://lappinalle.ru/. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.<br><br>
            Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).
        </p>
        <h2>
            Порядок сбора, хранения, передачи и других видов обработки персональных данных
        </h2>
        <p>
            Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.<br><br>
            Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.<br><br>
            Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства.<br><br>
            В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора info@lappinalle.ru с пометкой «Актуализация персональных данных».<br><br>
            Срок обработки персональных данных является неограниченным. Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора info@lappinalle.ru с пометкой «Отзыв согласия на обработку персональных данных».
        </p>
        <h2>
            Трансграничная передача персональных данных
        </h2>
        <p>
            Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.<br><br>
            Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных.
        </p>
        <h2>
            Заключительные положения
        </h2>
        <p>
            Пользователь может получить любые разъяснения по

            интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты info@lappinalle.ru<br><br>
            В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.<br><br>
            Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу https://lappinalle.ru/privacy.<br><br><br><br>
        </p>
    </div>
</template>

<script>
    export default {
        name: "Privacy"
    }
</script>

<style scoped>
    .privacy{
        position: relative;
    }
    h1{
        font-family: 'PT Sans', sans-serif;
        font-size: 24px;
        font-weight: 700;
        line-height: 1.5;
        margin-bottom: 75px;
        margin-top: 75px;
    }
    h2{
        font-family: 'PT Sans', sans-serif;
        font-size: 18px;
        font-weight: 700;
        line-height: 1.5;
        color: #848CCF;
        margin-bottom: 25px;
    }
    p{
        font-family: 'PT Sans', sans-serif;
        font-size: 14px;
        font-weight: 400;
        line-height: 1.8;
        margin-bottom: 50px;
    }
    @media screen and (max-width: 576px) {
        .privacy{
            position: relative;
        }
        h1{
            font-family: 'PT Sans', sans-serif;
            font-size: 24px;
            font-weight: 700;
            line-height: 1.5;
            margin-bottom: 30px;
            margin-top: 30px;
        }
        h2{
            font-family: 'PT Sans', sans-serif;
            font-size: 18px;
            font-weight: 700;
            line-height: 1.5;
            color: #848CCF;
            margin-bottom: 25px;
        }
        p{
            font-family: 'PT Sans', sans-serif;
            font-size: 14px;
            font-weight: 400;
            line-height: 1.8;
            margin-bottom: 50px;
        }
        p:last-child{
            margin-bottom: 0;
        }
    }

</style>
