<template>
    <div class="return-product container">
        <h1>
            Правила возврата товаров
        </h1>
        <h2>
            Возврат товара надлежащего качества
        </h2>
        <h3>
            Срок возврата товара
        </h3>
        <p>
            Срок возврата товара надлежащего качества составляет 14 дней с момента получения товара, если иное не было оговорено при продаже товара.
        </p>
        <p>
            Причинами для возврата товара со стороны Покупателя могут быть следующие:
        </p>
        <ul>
            <li>не подошел размер</li>
            <li>не подошёл фасон</li>
            <li>не подошел цвет</li>
            <li>не подошла длина и т.п.</li>
        </ul>
        <p class="sale">
            Товар принимается к возврату только в полной комплектации, со всеми упаковками и наклейками, в неношеном/неиспользованном виде.
        </p>
        <h3>
            Возврат товара надлежащего качества осуществляется:
        </h3>
        <p>Путём отправки в адрес отправителя любым способом за счёт покупателя.</p>
        <h3>
            Самостоятельный возврат:
        </h3>
        <p>
            Покупатель может самостоятельно вернуть не подошедший товар в наши пункты выдачи/возврата.
        </p>
        <h2>
            Возврат товара ненадлежащего качества
        </h2>
        <h3>
            Срок возврата товара
        </h3>
        <p>
            Причиной для возврата товара со стороны Покупателя может быть производственный недостаток (брак) товара. Покупатель может обратиться с требованием о возврате такого товара в течение 14 дней с момента получения товара, если иное не было оговорено при продаже товара.
        </p>
        <h3>
            Возврат товара ненадлежащего качества осуществляется следующим способом:
        </h3>
        <p>
            Возврат товара осуществляется посредством оформления заявки в Личном кабинете.
            <br>
            <br>
            Срок рассмотрения заявки не превышает 5 (пять) рабочих дней.
            <br>
            <br>
            В случае, если по результату рассмотрения заявки Продавцом принято положительное решение, покупатель может передать товар для возврата в Пункт выдачи заказов или путём отправки в адрес отправителя любым способом за счёт покупателя.
            <br>
            <br>
            В случае отклонения заявки, покупатель вправе обратиться в независимую экспертизу. Все расходы, связанные с проведением независимой экспертизы, производятся за счёт покупателя.

        </p>
    </div>
</template>

<script>
    export default {
        name: "ReturnProduct"
    }
</script>

<style scoped>

</style>
