<template>
    <div class="return-product container">
        <h1>
            Пользовательское Соглашение
        </h1>
        <p>
            Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ИП И. ЖУРАВЛЕВА (далее LAPPINALLE или Администрация) с одной стороны и пользователем сайта с другой.
            <br>
            Сайт LAPPINALLE не является средством массовой информации.
            <br>
            Используя сайт, Вы соглашаетесь с условиями данного соглашения.
        </p>
        <h3 class="sale">
            Если Вы не согласны с условиями данного соглашения, не используйте сайт LAPPINALLE!
        </h3>

        <h2>
            Права и обязанности сторон
        </h2>

        <h3>
            Пользователь имеет право:
        </h3>

        <ul>
            <li>осуществлять поиск информации на сайте</li>
            <li>получать информацию на сайте</li>
            <li>комментировать контент, выложенный на сайте</li>
            <li>копировать информацию на другие сайты с указанием источника</li>
            <li>использовать информацию сайта в личных некоммерческих целях</li>
        </ul>

        <h3>
            Администрация имеет право:
        </h3>

        <ul>
            <li>по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
            <li>ограничивать доступ к любой информации на сайте</li>
            <li>создавать, изменять, удалять информацию</li>
            <li>удалять учетные записи</li>
        </ul>

        <h3>
            Пользователь обязуется:
        </h3>

        <ul>
            <li>обеспечить достоверность предоставляемой информации</li>
            <li>обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</li>
            <li>не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</li>
            <li>не нарушать работоспособность сайта</li>
            <li>не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
            <li>не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
        </ul>

        <h3>
            Администрация обязуется:
        </h3>

        <ul>
            <li>поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
            <li>осуществлять разностороннюю защиту учетной записи Пользователя</li>
        </ul>

        <h2>
            Ответственность сторон
        </h2>

        <ul>
            <li>администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
            <li>в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
        </ul>

        <h2>
            Условия действия Соглашения
        </h2>

        <p>
            Данное Соглашение вступает в силу при любом использовании данного сайта.
            <br>
            Соглашение перестает действовать при появлении его новой версии.
            <br>
            Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
            <br>
            Администрация не оповещает пользователей об изменении в Соглашении.

        </p>
    </div>
</template>

<script>
    export default {
        name: "UserAccept"
    }
</script>

<style scoped>

</style>
